** Capture Templates

#+begin_src elisp
  (setq
     org-capture-templates
     `(
       (
        "t" "Todo" entry
        (file+headline "~/Work/todo-lists/datarisk.org" "TODO-LIST: Tech Unit")
        (file "~/.emacs.d/org-templates/todo.org")
        :prepend t
        )
       (
        "m" "Meeting Summary" entry
        (file+headline "~/Work/meeting-summaries.org" "Meeting Summaries - Tech Unit")
        (file "~/.emacs.d/org-templates/meeting-summary.org")
        :prepend t
        :jump-to-captured t
        )
       (
        "p" "Meeting Summary - Portuguese" entry
        (file+headline "~/Work/meeting-summaries.org" "Meeting Summaries - Other")
        (file "~/.emacs.d/org-templates/meeting-summary-pt.org")
        :prepend t
        :jump-to-captured t
        )
       (
        "e" "Engineering Journal" entry
        (file "~/.emacs.d/engineering-journal.org")
        "* %?\n:PROPERTIES:\n:DATE: %t\n:END:\n"
        :prepend t
        :jump-to-captured t
        )
       (
        "b" "Book Recommendation" entry
        (file "~/Work/todo-lists/books.org")
        (file "~/.emacs.d/org-templates/book-recommendation.org")
        :prepend nil
        :empty-lines 1
        :jump-to-captured t
        )
       ("v" "Team Event" entry
        (file+olp+datetree "~/Work/tech-unit/documentation/culture/events.org")
        "* %^{Name}           :%^{Type|tech_talk|debate}:\n%^{Subject}"
        :time-prompt t)
       ("r" "Templates for recruitment process")
       ("rz" "Recruitment 0 - Approach Lead" entry
        (file "~/Work/tech-unit/recruitment-emails.org")
        (file "~/Work/tech-unit/recruitment/email-templates/00-approach-lead.org"))
       ("rx" "Recruitment 1 - Pair Programming" entry
        (file "~/Work/tech-unit/recruitment-emails.org")
        (file "~/Work/tech-unit/recruitment/email-templates/10-pair-programming.org"))
       ("rc" "Recruitment 2 - Approved bur No Positions Now Invitation to Club" entry
        (file "~/Work/tech-unit/recruitment-emails.org")
        (file "~/Work/tech-unit/recruitment/email-templates/20-invitation-to-club.org"))
       ("d" "Org drill")
       ("dp"
        "PDF catpure"
        entry
        (file "/home/jz/SideProjects/spaced-repetition-decks/inbox.org")
        ,(concat "* Item        :drill:\n"
                 ":PROPERTIES:\n:DATE_ADDED: %u\n:SOURCE: %l\n:END:\n\n"
		     "%(org-capture-pdf-active-region)\n%?\n")
        :empty-lines 1
        :immediate-finish nil)
       ("dt"
        "Text catpure"
        entry
        (file "/home/jz/SideProjects/spaced-repetition-decks/inbox.org")
        ,(concat "* Item        :drill:\n"
                 ":PROPERTIES:\n:DATE_ADDED: %u\n:SOURCE: %l\n:END:\n\n"
		     "%i\n%?\n")
        :empty-lines 1
        :immediate-finish nil)
       )
     )
#+end_src

#+RESULTS:
| t | Todo                         | entry | (file+headline ~/Work/todo-lists/datarisk.org TODO-LIST: Tech Unit)        | (file ~/.emacs.d/org-templates/todo.org)               | :prepend | t |                   |   |
| m | Meeting Summary              | entry | (file+headline ~/Work/meeting-summaries.org Meeting Summaries - Tech Unit) | (file ~/.emacs.d/org-templates/meeting-summary.org)    | :prepend | t | :jump-to-captured | t |
| p | Meeting Summary - Portuguese | entry | (file+headline ~/Work/meeting-summaries.org Meeting Summaries - Other)     | (file ~/.emacs.d/org-templates/meeting-summary-pt.org) | :prepend | t | :jump-to-captured | t |
| e | Engineering Journal          | entry | (file ~/.emacs.d/engineering-journal.org)                                  | * %?                                                   |          |   |                   |   |

